TexasInstruments/c2000ware-core-sdk/driverlib/f28p55x/driverlib/inc/hw_epg.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the EPGMXSEL1 register
//
//*************************************************************************************************
#define EPG_MXSEL1_SEL32   0x1U          // DATAOUT[32] mux select.
#define EPG_MXSEL1_SEL33   0x2U          // DATAOUT[33] mux select.
#define EPG_MXSEL1_SEL34   0x4U          // DATAOUT[34] mux select.
#define EPG_MXSEL1_SEL35   0x8U          // DATAOUT[35] mux select.
#define EPG_MXSEL1_SEL36   0x10U         // DATAOUT[36] mux select.
#define EPG_MXSEL1_SEL37   0x20U         // DATAOUT[37] mux select.
#define EPG_MXSEL1_SEL38   0x40U         // DATAOUT[38] mux select.
#define EPG_MXSEL1_SEL39   0x80U         // DATAOUT[39] mux select.
#define EPG_MXSEL1_SEL40   0x100U        // DATAOUT[40] mux select.
#define EPG_MXSEL1_SEL41   0x200U        // DATAOUT[41] mux select.
#define EPG_MXSEL1_SEL42   0x400U        // DATAOUT[42] mux select.
#define EPG_MXSEL1_SEL43   0x800U        // DATAOUT[43] mux select.
#define EPG_MXSEL1_SEL44   0x1000U       // DATAOUT[44] mux select.
#define EPG_MXSEL1_SEL45   0x2000U       // DATAOUT[45] mux select.
#define EPG_MXSEL1_SEL46   0x4000U       // DATAOUT[46] mux select.
#define EPG_MXSEL1_SEL47   0x8000U       // DATAOUT[47] mux select.
#define EPG_MXSEL1_SEL48   0x10000U      // DATAOUT[48] mux select.
#define EPG_MXSEL1_SEL49   0x20000U      // DATAOUT[49] mux select.
#define EPG_MXSEL1_SEL50   0x40000U      // DATAOUT[50] mux select.
#define EPG_MXSEL1_SEL51   0x80000U      // DATAOUT[51] mux select.
#define EPG_MXSEL1_SEL52   0x100000U     // DATAOUT[52] mux select.
#define EPG_MXSEL1_SEL53   0x200000U     // DATAOUT[53] mux select.
#define EPG_MXSEL1_SEL54   0x400000U     // DATAOUT[54] mux select.
#define EPG_MXSEL1_SEL55   0x800000U     // DATAOUT[55] mux select.
#define EPG_MXSEL1_SEL56   0x1000000U    // DATAOUT[56] mux select.
#define EPG_MXSEL1_SEL57   0x2000000U    // DATAOUT[57] mux select.
#define EPG_MXSEL1_SEL58   0x4000000U    // DATAOUT[58] mux select.
#define EPG_MXSEL1_SEL59   0x8000000U    // DATAOUT[59] mux select.
#define EPG_MXSEL1_SEL60   0x10000000U   // DATAOUT[60] mux select.
#define EPG_MXSEL1_SEL61   0x20000000U   // DATAOUT[61] mux select.
#define EPG_MXSEL1_SEL62   0x40000000U   // DATAOUT[62] mux select.
#define EPG_MXSEL1_SEL63   0x80000000U   // DATAOUT[63] mux select.

//*************************************************************************************************
//
// The following are defines for the bit fields in the EPGMXSELLOCK register
//
//*************************************************************************************************
#define EPG_MXSELLOCK_EPGMXSEL0   0x1U   // EPGMXSEL0 lock bit
#define EPG_MXSELLOCK_EPGMXSEL1   0x2U   // EPGMXSEL1 lock bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the EPGMXSELCOMMIT register
//
//*************************************************************************************************
#define EPG_MXSELCOMMIT_EPGMXSEL0   0x1U   // EPGMXSEL0 commit bit
#define EPG_MXSELCOMMIT_EPGMXSEL1   0x2U   // EPGMXSEL1 commit bit



#endif
